# 1 Пользователь вводит количество дней,
#  указывает процент скидки и вводит сумму. 
#  Рассчитать прибыль, если за каждый день сумма увеличивается на 3 $ 
# и затем применяется скидка, то есть итоговая сумма еще увеличивается на данное число процентов.

# 2 Дано значение температуры в градусах Цельсия. Вывести температуру  в градусах Фаренгейта.
# Пользователь вводит время в минутах и расстояние в километрах. Найдите скорость в м/c.

# amount_days = int(input('Введите число дней>> '))
# persent_sale = int(input('Введите '))





# 1. Напишите программу, которая будет на вход принимать число N и выводить числа от -N до N
    
#     *Примеры:* 
    
#     - 5 -> -5, -4, -3, -2, -1, 0, 1, 2, 3, 4, 5
# 2. Напишите программу, которая будет принимать на вход дробь и показывать первую цифру дробной части числа.

# number = int(input('enter number: '))   <--rewenie
# if number < 0:
#     number = -number
# list_of_number = []
# for num in range(-number, number-1):
#     list_of_number.append(num)
# print(list_of_number)
 

# isdigit()
# isalpha     <---загуглить и разобраться



# number2 = float(input("Enter number : "))

# result = math.floor(number2 % math.floor(number2)*10)

# if result == 0:
#     print(f"{number2} - > нет")
# else :
#     print(f"{number2} - > {result}")


# n = float(input('введите число:   ')) ---ewe odno rewenie
# if n%1 == 0:
#     print ('нет')
# else:
#  n1=int(n%1*10)
#  print(n1)


# number = input('введите дробное число: ')
# comma_index = number.index(',')               <----i ewe odno
# print(number[comma_index + 1])

# print ('Введите десятичную дробь')
# number = float(input())
# print(round(int(number*10%10)))


# int = round = ceil = floor

# lis.append(n)     --odni i teje lu4we 2i sposob
# lis = lis + [n]
